Revit 2015 API
ViewCropRegionShapeManager.RemoveCropRegionShape Method
 Removes boundaries of crop region.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 2015.0.0.0 (2015.0.0.0)
Since: 2014
Syntax
C#
public void RemoveCropRegionShape()
Visual Basic
Public Sub RemoveCropRegionShape
Visual C++
public:
void RemoveCropRegionShape()
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  View is not allowed to manage crop region shape.
See Also
ViewCropRegionShapeManager Class
Autodesk.Revit.DB Namespace